## The TMDb database

I will be exploring [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. The TMDb database supports 39 official languages used in over 180 countries daily and dates back all the way to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the TMDb database consists of `12 tables` containing information about movies, cast, genre, and so much more.  

Let's get started!

## Loading the database

Before you begin, you need to prepare your SQL environment.  You can do this by loading the magic command `%load_ext sql`.

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

Next, go ahead and load your database. To do this, you will need to ensure you have downloaded the `TMDB.db` sqlite file and have stored it in a known location.

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql sqlite:///TMDB-a-4006.db

'Connected: @TMDB-a-4006.db'

## Questions 

I will invesigate this dataset to answer some questions by executing some SQL queries.

### Question 1

Who won the Oscar for “Actor in a Leading Role” in  2015?

In [4]:
%%sql

SELECT *
FROM oscars
WHERE
    year = 2015
    AND winner = 1.0
    AND award like "Actor in a Leading Role"
LIMIT 1000

 * sqlite:///TMDB-a-4006.db
Done.

[('2015', 'Actor in a Leading Role', '1.0', 'Leonardo DiCaprio', 'The Revenant')]

### Question 2

What is the ten oldest movies in the database?

In [5]:
%%sql

SELECT title
FROM movies
WHERE
    release_date IS NOT NULL ORDER BY release_date ASC
LIMIT 10

 * sqlite:///TMDB-a-4006.db
Done.

[('Intolerance',),
 ('The Big Parade',),
 ('Metropolis',),
 ("Pandora's Box",),
 ('The Broadway Melody',),
 ("Hell's Angels",),
 ('A Farewell to Arms',),
 ('42nd Street',),
 ('She Done Him Wrong',),
 ('It Happened One Night',)]

### Question 3

How many unique awards are there in the Oscars table?

In [6]:
%%sql

SELECT 
    COUNT(DISTINCT award)
FROM oscars
LIMIT 100

 * sqlite:///TMDB-a-4006.db
Done.

[(114,)]

### Question 4

How many movies are there that contain the word “Spider” within their title?

In [7]:
%%sql

SELECT COUNT(*)
FROM movies
WHERE title LIKE '%Spider%'

 * sqlite:///TMDB-a-4006.db
Done.

[(9,)]

### Question 5

How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?

In [9]:
%%sql

SELECT
    count(*)
FROM movies
JOIN genremap
ON movies.movie_id = genremap.movie_id
JOIN genres
ON genremap.genre_id = genres.genre_id
JOIN keywordmap
ON movies.movie_id = keywordmap.movie_id
JOIN keywords
ON keywordmap.keyword_id = keywords.keyword_id
WHERE
    genre_name = 'Thriller'
    AND keyword_name LIKE '%love%'
LIMIT 1000

 * sqlite:///TMDB-a-4006.db
Done.

[(55,)]

### Question 6

How many movies are there that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000?

In [10]:
%%sql

SELECT COUNT(DISTINCT movie_id)
FROM movies
WHERE
    release_date BETWEEN '2006-08-01' AND '2009-10-01'
    AND
    popularity > 40
    AND
    budget < 50000000
ORDER BY release_date
LIMIT 100

 * sqlite:///TMDB-a-4006.db
Done.

[(29,)]

### Question 7

what are the films whwre unique characters has "Vin Diesel" played so far in the database?

In [15]:
%%sql

SELECT 
    DISTINCT casts.characters,
    actors.actor_name
FROM movies
JOIN casts
ON movies.movie_id = casts.movie_id
JOIN actors
ON casts.actor_id = actors.actor_id
WHERE actors.actor_name = "Vin Diesel"
GROUP BY 1
LIMIT 100

 * sqlite:///TMDB-a-4006.db
Done.

[('Chris Varick', 'Vin Diesel'),
 ('Dominic Toretto', 'Vin Diesel'),
 ('Dominic Toretto (uncredited)', 'Vin Diesel'),
 ('Finger (voice)', 'Vin Diesel'),
 ('Groot (voice)', 'Vin Diesel'),
 ('Jackie DiNorscio', 'Vin Diesel'),
 ('Kaulder', 'Vin Diesel'),
 ('Private Adrian Caparzo', 'Vin Diesel'),
 ('Richard B. Riddick', 'Vin Diesel'),
 ('Riddick', 'Vin Diesel'),
 ('Sean Vetter', 'Vin Diesel'),
 ('Shane Wolf', 'Vin Diesel'),
 ('Taylor Reese', 'Vin Diesel'),
 ('The Iron Giant (voice)', 'Vin Diesel'),
 ('Toorop', 'Vin Diesel'),
 ('Xander Cage', 'Vin Diesel')]

### Question 8

What are the genres of the movie “The Royal Tenenbaums”?

In [16]:
%%sql

SELECT
    movies.title,
    genres.genre_name
FROM movies
JOIN genremap
ON movies.movie_id = genremap.movie_id
JOIN genres
ON genremap.genre_id = genres.genre_id
WHERE
    movies.title LIKE 'The Royal Tenen%'
LIMIT 100

 * sqlite:///TMDB-a-4006.db
Done.

[('The Royal Tenenbaums', 'Drama'), ('The Royal Tenenbaums', 'Comedy')]

### Question 9

What are the three production companies that have the highest movie popularity score on average, as recorded within the database?

In [18]:
%%sql

SELECT
    productioncompanies.production_company_name,
    AVG(movies.popularity)
FROM movies
JOIN productioncompanymap
ON movies.movie_id = productioncompanymap.movie_id
JOIN productioncompanies
ON productioncompanymap.production_company_id = productioncompanies.production_company_id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 3

 * sqlite:///TMDB-a-4006.db
Done.

[("The Donners' Company", 514.569956),
 ('Bulletproof Cupid', 481.098624),
 ('Kinberg Genre', 326.92099900000005)]

### Question 10

How many female actors (i.e. gender = 1) have a name that starts with the letter "N"?

In [19]:
%%sql

SELECT COUNT(actor_name)
FROM actors
WHERE 
    gender = 1
    AND
    actor_name LIKE 'N%'
LIMIT 100

 * sqlite:///TMDB-a-4006.db
Done.

[(355,)]

### Question 11

Which genre has, on average, the lowest movie popularity score?

In [20]:
%%sql

SELECT
    genres.genre_name,
    AVG(movies.popularity)
FROM movies
JOIN genremap
ON movies.movie_id = genremap.movie_id
JOIN genres
ON genremap.genre_id = genres.genre_id
GROUP BY 1
ORDER BY 2 ASC
LIMIT 1

 * sqlite:///TMDB-a-4006.db
Done.

[('Foreign', 0.686786794117647)]

### Question 12

Which award category has the highest number of actor nominations (actors can be male or female)? (Hint: `Oscars.name` contains both actors' names and film names.)

In [21]:
%%sql

SELECT 
    DISTINCT award,
    COUNT(name)
FROM oscars
JOIN actors
ON oscars.name = actors.actor_name
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1

 * sqlite:///TMDB-a-4006.db
Done.

[('Actor in a Supporting Role', 356)]